Repository: 10088/Behat
Catalog: i18n/*.xliff
Languages: it, ja

# proposal-title
source: You can implement step definitions for undefined steps with these snippets:
it: E' possibile implementare gli step ancora non definiti con queste parti di codice:
ja: 未定義のステップを、次のスニペットで実装できます:

# failed-steps-title
source: failed steps
it: step falliti
ja: 失敗したステップ

# pending-steps-title
source: pending steps
it: step pendenti
ja: ペンディング中のステップ

# scenarios-count
source: {0} No scenarios|{1} 1 scenario|]1,Inf] %1% scenarios
it: {0} Nessuno scenario|{1} 1 scenario|]1,Inf] %1% scenari
ja: {0} シナリオがありません|{1} 1 個のシナリオ|]1,Inf] %1% 個のシナリオ

# steps-count
source: {0} No steps|{1} 1 step|]1,Inf] %1% steps
it: {0} Nessuno step|{1} 1 step|]1,Inf] %1% step
ja: {0} ステップがありません|{1} 1 個のステップ|]1,Inf] %1% 個のステップ

# passed-count
source: [1,Inf] %1% passed
it: [1,Inf] %1% passato
ja: [1,Inf] %1% 個成功

# failed-count
source: [1,Inf] %1% failed
it: [1,Inf] %1% fallito
ja: [1,Inf] %1% 個失敗

# pending-count
source: [1,Inf] %1% pending
it: [1,Inf] %1% pendente
ja: [1,Inf] %1% 個ペンディング

# undefined-count
source: [1,Inf] %1% undefined
it: [1,Inf] %1% non definito
ja: [1,Inf] %1% 個未定義

# skipped-count
source: [1,Inf] %1% skipped
it: [1,Inf] %1% saltato
ja: [1,Inf] %1% 個スキップ
